prod-deploy/results/prod-01-2d-fullretest-20260717/fio/groupA/randread-r3.txt
storage_test: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes

storage_test: (groupid=0, jobs=128): err= 0: pid=374062: Fri Jul 17 19:17:17 2026
  read: IOPS=5898, BW=1475MiB/s (1546MB/s)(259GiB/180046msec)
    slat (usec): min=103, max=113735, avg=21694.00, stdev=19741.17
    clat (usec): min=2, max=4477.3k, avg=2734337.56, stdev=323562.76
     lat (msec): min=2, max=4483, avg=2756.03, stdev=324.41
    clat percentiles (msec):
     |  1.00th=[ 1854],  5.00th=[ 2333], 10.00th=[ 2433], 20.00th=[ 2534],
     | 30.00th=[ 2601], 40.00th=[ 2668], 50.00th=[ 2735], 60.00th=[ 2802],
     | 70.00th=[ 2869], 80.00th=[ 2937], 90.00th=[ 3071], 95.00th=[ 3205],
     | 99.00th=[ 3574], 99.50th=[ 3708], 99.90th=[ 4010], 99.95th=[ 4077],
     | 99.99th=[ 4279]
   bw (  MiB/s): min=  512, max= 2184, per=99.70%, avg=1470.26, stdev= 1.77, samples=22764
   iops        : min= 2226, max=10434, avg=5891.41, stdev= 9.31, samples=45436
  lat (usec)   : 4=0.01%, 10=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.03%
  lat (msec)   : 250=0.08%, 500=0.12%, 750=0.13%, 1000=0.13%, 2000=0.65%
  lat (msec)   : >=2000=98.84%
  cpu          : usr=0.02%, sys=0.11%, ctx=2147708, majf=4, minf=1050755
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.4%, >=64=99.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=1062029,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=1475MiB/s (1546MB/s), 1475MiB/s-1475MiB/s (1546MB/s-1546MB/s), io=259GiB (278GB), run=180046-180046msec